#+TITLE:     Org Beamer quick reference card
#+AUTHOR:    Fabrice Niessen
#+EMAIL:     (concat "fniessen" at-sign "pirilampo.org")
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:2 num:nil ^:{}

#+PROPERTY:  eval no
# #+SETUPFILE: ~/src/org-style/setup/bigblow-local-abs.setup
#+SETUPFILE: ~/src/org-style/setup/leuven-local-abs.setup

#+LaTeX_CLASS_OPTIONS: [presentation, t]
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_act(Act) %4BEAMER_col(Col) %8BEAMER_opt(Opt)
#+PROPERTY: BEAMER_col_ALL 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 0.0 :ETC

#+LaTeX_HEADER: \setbeamertemplate{navigation symbols}{}

#+BEAMER_THEME: Boadilla
# #+BEAMER_THEME: AnnArbor

# include navigation bars
# #+BEAMER_THEME: Antibes

# include a table of contents sidebar
# #+BEAMER_THEME: Hannover

# include a "Mini Frame Navigation"
# #+BEAMER_THEME: Singapore

# have the section and subsection titles at the top of each frame
# #+BEAMER_THEME: Warsaw

#+BEAMER_COLOR_THEME: crane

#+BEAMER_HEADER: \usepackage{lxfonts}
#+BEAMER_HEADER: \usefonttheme{professionalfonts}

#+INCLUDE: "~/src/stage-latex-dunkerque-2013/style/listings.org"

#+LATEX_HEADER: \lstdefinelanguage{R}{}

#+LATEX_HEADER: \definecolor{mylinkcolor}{HTML}{006DAF}
#+LATEX_HEADER: \hypersetup{colorlinks=true, linkcolor=mylinkcolor, urlcolor=mylinkcolor}

#+LATEX_HEADER: \usepackage{tikz}
# For every picture that defines or uses external nodes, you'll have to
# apply the 'remember picture' style. To avoid some typing, we'll apply
# the style to all pictures.
#+LaTeX: \tikzstyle{every picture}+=[remember picture]

** Frame with code

Here is a simple R code block...

#+begin_src org
,#+begin_src R :exports both
summary(cars)
,#+end_src
#+end_src

... that will display the code and show its output in the frame:

#+begin_src R :eval yes :exports both
summary(cars)
#+end_src

#+results:
| Min.   : 4.0 | Min.   :  2.00 |
| 1st Qu.:12.0 | 1st Qu.: 26.00 |
| Median :15.0 | Median : 36.00 |
| Mean   :15.4 | Mean   : 42.98 |
| 3rd Qu.:19.0 | 3rd Qu.: 56.00 |
| Max.   :25.0 | Max.   :120.00 |

XXX Is this needed?

#+BEGIN_SRC org
,#+LATEX_HEADER: \lstdefinelanguage{R}{}
#+END_SRC

** Frame with output only

To display the output of a code block without echoing the underlying code, you
specify the ~:exports results~ option:

#+begin_src org
,#+begin_src R :exports results
summary(cars)
,#+end_src
#+end_src

It only renders the results:

#+begin_src R :eval yes :exports results
summary(cars)
#+end_src

#+results:
| Min.   : 4.0 | Min.   :  2.00 |
| 1st Qu.:12.0 | 1st Qu.: 26.00 |
| Median :15.0 | Median : 36.00 |
| Mean   :15.4 | Mean   : 42.98 |
| 3rd Qu.:19.0 | 3rd Qu.: 56.00 |
| Max.   :25.0 | Max.   :120.00 |

